---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTable.Dispose
source: html/d86d01e4-6810-43bd-12ec-2a2d3586aa73.htm
---
# Autodesk.Revit.DB.FamilySizeTable.Dispose Method

Releases all resources used by the FamilySizeTable

## Syntax (C#)
```csharp
public void Dispose()
```